test/workflow/cases/tube_bank/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0.0 0.0 0.0)
    (0.576 0.0 0.0)
    (0.576 0.16 0.0)
    (0.0 0.16 0.0)
    (0.0 0.0 0.02)
    (0.576 0.0 0.02)
    (0.576 0.16 0.02)
    (0.0 0.16 0.02)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (120 33 4) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    frontBack
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
            (0 3 2 1)
        );
    }
);

mergePatchPairs ();
