test/workflow/cases/tube_bank/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     incompressibleFluid;
startFrom       startTime;
    startTime       0;
stopAt          endTime;
    endTime         0.5;
deltaT          0.002;
writeControl    timeStep;
    writeInterval   50;
purgeWrite      0;
    writeFormat     ascii;
    writePrecision  6;
writeCompression off;
    timeFormat      general;
    timePrecision   6;
runTimeModifiable true;
    adjustTimeStep  no;
    maxCo           0.5;
