test/workflow/cases/tube_bank/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  diagonal;
        tolerance       1e-8;
        relTol          1e-5;
        maxIter         300;
    }
    pFinal
    {
        $p;
        relTol          0;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }
    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
        momentumPredictor   yes;
        nCorrectors         2;
        nNonOrthogonalCorrectors 1;
        pRefCell            0;
        pRefValue           0;
}
